[
  {
    "title": "Test 2",
    "title_uk": "Тест 2",
    "date": "2026-01-05T22:43:00.000Z",
    "excerpt": "Desc",
    "excerpt_uk": "Опис",
    "content": "<p>Text</p>",
    "content_uk": "<p>Текст</p>",
    "slug": "test-2",
    "tags": [],
    "draft": false
  },
  {
    "title": "The first post that I've created",
    "title_uk": "Перша стаття, яку я створив",
    "date": "2025-12-22T00:00:00.000Z",
    "excerpt": "In this article, I want to dive deeper into the personal experiences that have shaped my perspective on user experience design",
    "excerpt_uk": "У цій статті я хочу глибше зануритися в особистий досвід, який сформував мою перспективу щодо дизайну користувацького досвіду",
    "content": "<p>In this article, I want to dive deeper into the personal experiences that have shaped my perspective on user experience design. The excerpt above touches on the surface, but there's so much more to explore.</p>\n<p>Throughout my career, I've encountered numerous situations where the user experience fell short of expectations. These experiences have taught me valuable lessons about what truly matters in design.</p><h2>Key Insights</h2>\n<p>One of the most important realizations I've had is that user experience isn't just about the interface—it's about the entire ecosystem surrounding the user's journey.</p>\n<p>This includes their emotional state, the context of their environment, the tasks they're trying to accomplish, and the broader system they're interacting with.</p><h2>Moving Forward</h2>\n<p>Understanding these interconnected elements is crucial for creating truly meaningful experiences. It's not enough to focus on individual touchpoints; we need to consider the holistic user journey.</p>",
    "content_uk": "<p>У цій статті я хочу глибше зануритися в особистий досвід, який сформував мою перспективу щодо дизайну користувацького досвіду. Наведений вище уривок лише торкається поверхні, але є ще багато чого для дослідження.</p>\n<p>Протягом моєї кар'єри я стикався з численними ситуаціями, коли користувацький досвід не виправдовував очікувань. Цей досвід навчив мене цінним урокам про те, що насправді має значення в дизайні.</p><h2>Ключові висновки</h2>\n<p>Одне з найважливіших усвідомлень, до якого я прийшов, полягає в тому, що користувацький досвід - це не лише інтерфейс, а вся екосистема, що оточує подорож користувача.</p>\n<p>Це включає їхній емоційний стан, контекст їхнього середовища, завдання, які вони намагаються виконати, та ширшу систему, з якою вони взаємодіють.</p><h2>Рухаючись вперед</h2>\n<p>Розуміння цих взаємопов'язаних елементів є вирішальним для створення справді значущих переживань. Недостатньо зосереджуватися на окремих точках дотику; нам потрібно розглядати цілісну подорож користувача.</p>\n",
    "slug": "personal-experience",
    "tags": [
      "ux",
      "experience",
      "design"
    ],
    "draft": false
  }
]