[
  {
    "title": "Why This Blog",
    "title_uk": "Навіщо цей блог",
    "date": "2025-11-13T20:51:00.000Z",
    "excerpt": "At some point, after enough years in product, you end up with a ridiculous amount of thoughts, stories, lessons, and random experiences",
    "excerpt_uk": "З часом в продакті назбирується така кількість думок, історій, крінжових ситуацій і тих самих “aha momens”, що вони просто тонуть в нотатках",
    "content": "<p>At some point, after enough years in product, you end up with a ridiculous amount of thoughts, stories, lessons, and random experiences that never get shared anywhere. They sit in notes apps, in old decks, in voice memos recorded while traveling to work. None of it needs to be turned into a book or a “framework” — but it feels worth capturing somewhere.</p><p>I wanted a place to put all of that.<br>Somewhere simple, personal, and fully mine.</p><h2>Why build a site</h2>\n<p>Medium, Substack, all those platforms — they’re fine, but they never feel like home. Everything looks the same, everything follows a pattern, everything feels a little processed.</p>\n<p>I wanted a space that has my own tone and shape, without ads, popups, or whatever growth feature they’re pushing this month. Just a clean corner of the internet where I can write like a human, not like a platform user.</p><h2>Why write at all</h2>\n<p>I’ve had a career full of good moments, tough moments, strange moments, and ones that completely changed how I see things. A lot of that stays unspoken, buried under new deadlines and projects.</p><p>This blog is a way to catch those moments before they disappear.<br>A place to talk about work, people, growth, the industry, the journey — everything that doesn’t fit neatly into a portfolio block or a social media post.</p><h2>What to expect</h2>\n<p>You’ll find thoughts from real projects, reflections on career and growth, the human side of design and product, things I wish I’d known earlier, and small ideas that don’t need to be something more than a few paragraphs.</p><p>Nothing overproduced.<br>Nothing trying to go viral.<br>Just honest, personal writing.</p><h2>So… here we go</h2>\n<p>A simple start. My own space on the internet. No pressure, no agenda — just a place to put things I don’t want to lose.</p><p>If you’re reading this, thanks for being here.<br>Let’s see where it goes.</p>",
    "content_uk": "<p>З часом в продакті назбирується така кількість думок, історій, крінжових ситуацій і тих самих “aha momens”, що вони просто тонуть в нотатках, загублених файлах та voice memos, зроблених десь по дорозі на роботу.</p>\n<p>Не треба з усього цього робити книжку чи чергову \"унікальну\" методологію. Але воно варте того, щоб десь існувати, а не пилитись в архівах.</p><p>Хотілось мати місце, де все це складати — просте, особисте, справді моє.</p><h2>Чому власний сайт</h2>\n<p>Medium, Substack та всі інші платформи нормальні… але вони не про “своє”. Там усе однакове, передбачуване, шаблонне — грубовато, але це конвеєрна історія.</p>\n<p>Хотілось свого простору: без банерів, без попапів, без нав’язаних фіч для росту. Тихий куточок інтернету, де можна писати як людина, а не як черговий юзер платформи.</p><h2>Навіщо взагалі писати</h2>\n<p>За роки роботи накопичуються моменти — класні, важкі, дивні, інколи такі, що повністю змінюють оптику. Більшість з них так і лишаються невимовленими, похованими під новими проєктами та дедлайнами.</p><p>Цей блог — спосіб упіймати ці моменти до того, як вони зникнуть.<br>Місце поговорити про роботу, людей, розвиток, індустрію, мій шлях — усе те, що не влізає в портфоліо чи пост в соціалці.</p><h2>Чого очікувати</h2>\n<p>Тут будуть думки з реальних проєктів, роздуми про кар’єру та зростання, трошки про людське в дизайні й продакті, речі, які хотів би знати напочатку шляху, і невеликі ідеї, яким цілком достатньо лишитися всього кількома абзацами.</p><p>Нічого глянцевого.<br>Нічого написаного під алгоритм.<br>Просто чесні, особисті тексти.</p><h2>Ну що ж, поїхали</h2>\n<p>Простий старт. Мій власний шматочок інтернету. Без тиску, без планів досягнути чогось, просто місце, куди можна складати речі, які не хочеться загубити.</p><p>Якщо читаєш це — дуже радий, що ти тут.<br>Подивимось, куди воно нас приведе.</p>",
    "slug": "why-this-blog",
    "tags": [
      "reflections",
      "ideas",
      "career",
      "personal"
    ],
    "draft": false
  }
]